/*  
реализуйте метод, принимающий в качестве аргумента целочисленный двумерный массив. 
Необходимо посчитать и вернуть сумму элементов этого массива. 

При этом накладывает на метод 2 ограничения: метод может работать только с квадратными массивами (кол'во строк : кол-в 
столбики), жэ каждой ячейке может лежать только значение О или 1.. 

гасли нарушается одно из условий, метод должен вернуть код ошибки. 
Программа должна корректно обработать код ошибки и вывести соответствующее сообщение пользователю: 
Сравнить такой вариант обработки исключений с предыдущим 
Какое преимущество у исключений перед косами ошибок  */










public class lesson_1_task3 {
    
}
